SCMU-EA/MSP432P401R/10.驱动AD9959/Basic/main.h
/*****************************
      官方头文件
*****************************/

#include "driverlib.h"
/******************************
    数据类型定义
******************************/
typedef signed long s32;
typedef signed short s16;
typedef signed char s8;
typedef signed long const sc32; /* Read Only */
typedef signed short const sc16; /* Read Only */
typedef signed char const sc8; /* Read Only */
typedef volatile signed long vs32;
typedef volatile signed short vs16;
typedef volatile signed char vs8;
typedef volatile signed long const vsc32; /* Read Only */
typedef volatile signed short const vsc16; /* Read Only */
typedef volatile signed char const vsc8; /* Read Only */
typedef unsigned long u32;
typedef unsigned short u16;
typedef unsigned char u8;
typedef unsigned long const uc32; /* Read Only */
typedef unsigned short const uc16; /* Read Only */
typedef unsigned char const uc8; /* Read Only */
typedef volatile unsigned long vu32;
typedef volatile unsigned short vu16;
typedef volatile unsigned char vu8;
typedef volatile unsigned long const vuc32; /* Read Only */
typedef volatile unsigned short const vuc16; /* Read Only */
typedef volatile unsigned char const vuc8; /* Read Only */
/****************************
      Basic内部外设头文件
*****************************/
#include "delay.h"
#include "sysinit.h"
//#include "rtc.h"
#include "gpio.h"
#include "uart.h"
#include "usart.h"
/* 串口屏 */
#include "hmi_user_uart.h"
#include "hmi_driver.h"
#include "cmd_queue.h"
#include "cmd_process.h"

/* 定时器 */
#include "timA.h"

/***************************
      Hardware外设头文件
*****************************/
#include "led.h"
#include "oled.h"

/* AD9959 */
#include "AD9959.h"





